""" nkapp.analysis.config.py """
#　市場区分コード
VALUE_MAP10 = {
    "0100": "0100: 全て",
    "0111": "0111: プライム",
    "0112": "0112: スタンダード",
    "0113": "0113: グロース",
    "0101": "0101: 東証一部",
    "0102": "0102: 東証二部",
    "0104": "0104: マザーズ",
    "0105": "0105: TOKYO PRO MARKET",
    "0106": "0106: JASDAX スタンダード",
    "0107": "0107: JASDAX グロース",
    "0109": "0109: その他",
}

#　計算方法
VALUE_MAP20 = {
    "0201": "0201:移動平均乖離率",
    "0202": "0202:RSI",
    "0203": "0203:MACD",
}

#　演算子
VALUE_MAP30 = {
    "="     : "=:代入",
    ">"     : ">:より大きい",
    "<"     : "<:より小さい",
    ">="    : ">=:以上",
    "<="    : "<=:以下",
    "=="    : "==:等しい",
    "+="    : "+=:足して代入",
    "-="    : "-=:引いて代入",
    "!="    : "!=:等しくない",
    "and>"  : "and:論理積",
    "or"    : "or:論理和",
    "not"   : "not:否定",
}

#　ソート順
VALUE_MAP40 = {
    "01": "01:昇順",
    "02": "02:降順",
}

#　ソート順
VALUE_MAP41 = {
    "adjustmentclose": "01:adjustmentclose",
    "deviation_rate" : "02:deviation_rate",
}
