""" nkapp.analysis.config.py """
# Market Code
VALUE_MAP10 = {
    "0100": "0100: 全て",
    "0111": "0111: プライム",
    "0112": "0112: スタンダード",
    "0113": "0113: グロース",
    "0101": "0101: 東証一部",
    "0102": "0102: 東証二部",
    "0104": "0104: マザーズ",
    "0105": "0105: TOKYO PRO MARKET",
    "0106": "0106: JASDAX スタンダード",
    "0107": "0107: JASDAX グロース",
    "0109": "0109: その他",
}

# 17-Sector Code:
VALUE_MAP11 = {
    "1100": "1100: 全て",
    "1"   : "1: 食品",
    "2"   : "2: エネルギー資源",
    "3"   : "3: 建設・資材",
    "4"   : "4: 素材・化学",
    "5"   : "5: 医薬品",
    "6"   : "6: 自動車・輸送機",
    "7"   : "7: 鉄鋼・非鉄",
    "8"   : "8: 機械",
    "9"   : "9: 電機・精密",
    "10"  : "10: 情報通信・サービスその他",
    "11"  : "11: 電気・ガス",
    "12"  : "12: 運輸・物流",
    "13"  : "13: 商社・卸売",
    "14"  : "14: 小売",
    "15"  : "15: 銀行",
    "16"  : "16: 金融（除く銀行）",
    "17"  : "17: 不動産",
    "99"  : "99: その他",
}

#　33-Sector Code:
VALUE_MAP12 = {
    "0000": "0000: 全て",
    "0050": "0050: 水産・農林業",
    "1050": "1050: 鉱業",
    "2050": "2050: 建設業",
    "3050": "3050: 食料品",
    "3100": "3100: 繊維製品",
    "3150": "3150: パルプ・紙",
    "3200": "3200: 化学",
    "3250": "3250: 医薬品",
    "3300": "3300: 石油･石炭製品",
    "3350": "3350: ゴム製品",
    "3400": "3400: ガラス･土石製品",
    "3450": "3450: 鉄鋼",
    "3500": "3500: 非鉄金属",
    "3550": "3550: 金属製品",
    "3600": "3600: 機械",
    "3650": "3650: 電気機器",
    "3700": "3700: 輸送用機器",
    "3750": "3750: 精密機器",
    "3800": "3800: その他製品",
    "4050": "4050: 電気･ガス業",
    "5050": "5050: 陸運業",
    "5100": "5100: 海運業",
    "5150": "5150: 空運業",
    "5200": "5200: 倉庫･運輸関連業",
    "5250": "5250: 情報･通信業",
    "6050": "6050: 卸売業",
    "6100": "6100: 小売業",
    "7050": "7050: 銀行業",
    "7100": "7100: 証券･商品先物取引業",
    "7150": "7150: 保険業",
    "7200": "7200: その他金融業",
    "8050": "8050: 不動産業",
    "9050": "9050: サービス業",
    "9999": "9999: その他",
}

# ScaleCategory
VALUE_MAP13 = {
    "": "0010: 全て",
    "TOPIX Core30": "0020: TOPIX Core30",
    "TOPIX Large70": "0030: TOPIX Large70",
    "TOPIX Mid400": "0040: TOPIX Mid400",
    "TOPIX Small1": "0050: TOPIX Small1",
    "TOPIX Small2": "0060: TOPIX Small2",
    "9999": "9999: その他",
}

# Custom Category
VALUE_MAP14 = {
    "0000": "0000: 全て",
    "0001": "0001: Nikkei225",
    "0010": "0010: ETFs",
    "1001": "1001: Custom-A",
    "1010": "1010: Custom-B",
    "1100": "1100: Custom-C",
    "9999": "9999: その他",
}

#　計算方法
VALUE_MAP20 = {
    "0200": "0200:移動平均",
    "0201": "0201:移動平均乖離率",
    "0202": "0202:RSI",
    "0203": "0203:MACD",
    "0250": "0250:定数",
}

#　演算子
VALUE_MAP30 = {
    ">"     : ">:AがBより大きい",
    "<"     : "<:AがBより小さい",
    ">="    : ">=:AがBと同等以上",
    "<="    : "<=:AがBより同等以下",
    "=="    : "==:AがBと等しい",
    "!="    : "!=:AがBと等しくない",
    "and>"  : "and:AとBの論理積",
    "or"    : "or:AとBの論理和",
    "not"   : "not:AとBの否定",
}

#　ソート順
VALUE_MAP40 = {
    "01": "01:昇順",
    "02": "02:降順",
}

#　ソート順
VALUE_MAP41 = {
    "adjustmentclose": "01:adjustmentclose",
    "deviation_rate" : "02:deviation_rate",
}


#　抽出条件
VALUE_MAP50 = {
    "0501": "0501:移動平均/乖離率",
    "0502": "0502:移動平均/GC",
    "0503": "0503:移動平均/DC",
    "0504": "0504:移動平均/モーメント",
    "0505": "0505:移動平均",
    "0511": "0511:RSI",
    "0599": "0599:Market Setting Only",
    "0521": "0521:MACD/GC(Test)",
    "0522": "0522:MACD/DC(工事中)",
    "0523": "0523:MACD/0_line GC(工事中)",
    "0524": "0524:MACD/0_line DC(工事中)",
    "0531": "0531:OSCV(工事中)",
    "0591": "0591:全て表示(テスト用)",
    "0592": "0592:全て非表示(テスト用)",
}
